app/Models/Core/Branch_Model.php

   function get_rowByPK($companyID,$branchID){
		$db 		= db_connect();
		$builder 	= $db->table('tb_branch');



		$builder->where('companyID', $companyID);
		$builder->where('branchID', $branchID);
		$builder->where('isActive', 1);
		$recordSet = $builder->get()->getRow();
---
SELECT *
FROM `tb_branch`
WHERE `companyID` = '2'
AND `branchID` = '2'
AND `isActive` = 1