app/Models/Core/Company_Parameter_Model.php

   function update_app_posme($companyID,$parameterID,$data){
		$db 		= db_connect();
		$builder 	= $db->table('tb_company_parameter');

		$builder->where("companyID",$companyID);
		$builder->where("parameterID",$parameterID);
		$builder->update($data);
---
UPDATE `tb_company_parameter` SET `value` = 999.9
WHERE `companyID` = '2'
AND `parameterID` = '80'