app/Models/Core/Counter_Model.php

UPDATE `tb_counter` SET `currentValue` = 1514
WHERE `companyID` = '2'
AND `branchID` = '2'
AND `componentID` = '48'
AND `componentItemID` = 0
---
   function update_app_posme($companyID,$branchID,$componentID,$componentItemID,$data){
		$db 		= db_connect();

		$builder 	= $db->table("tb_counter");
		$builder->where("companyID",$companyID );
		$builder->where("branchID",$branchID );
		$builder->where("componentID",$componentID );
		$builder->where("componentItemID",$componentItemID );

		return $builder->update($data);