app/Models/Price_Model.php

UPDATE `tb_price` SET `price` = 12, `percentage` = -40
WHERE `companyID` = '2'
AND `listPriceID` = '12'
AND `itemID` = '598'
AND `typePriceID` = '154'
---
   function update_app_posme($companyID,$listPriceID,$itemID,$typePriceID,$data){
		$db 	= db_connect();
		$builder	= $db->table("tb_price");

		$builder->where("companyID",$companyID);
		$builder->where("listPriceID",$listPriceID);
		$builder->where("itemID",$itemID);
		$builder->where("typePriceID",$typePriceID);
		return $builder->update($data);