app/Models/Transaction_Master_Model.php

INSERT INTO `tb_transaction_master` (`companyID`, `transactionID`, `branchID`, `transactionNumber`, `transactionCausalID`, `entityID`, `transactionOn`, `transactionOn2`, `statusIDChangeOn`, `componentID`, `note`, `sign`, `currencyID`, `currencyID2`, `exchangeRate`, `reference1`, `descriptionReference`, `reference2`, `reference3`, `reference4`, `statusID`, `amount`, `isApplied`, `journalEntryID`, `classID`, `areaID`, `sourceWarehouseID`, `targetWarehouseID`, `isActive`, `createdOn`, `createdBy`, `createdIn`, `createdAt`) VALUES ('2', '19', '2', 'FAC00001513', '21', '13', '2023-04-09', '2023-04-09', '2023-04-09 14:04:04', '48', '', '-1', '1', '2', 36.2924, '0', 'reference1:entityID del proveedor de credito para las facturas al credito,reference4: customerCreditLineID linea de credito del cliente', '0', '0', '0', '66', 0, 0, 0, NULL, NULL, '4', NULL, 1, '2023-04-09 14:41:04', '2', '::1', '2')
---
   function insert_app_posme($data){
		$db 		= db_connect();
		$builder	= $db->table("tb_transaction_master");

		$result = $builder->insert($data);

UPDATE `tb_transaction_master` SET `transactionCausalID` = '21', `entityID` = '13', `transactionOn` = '2023-05-03', `transactionOn2` = '2023-05-18', `statusIDChangeOn` = '2023-05-03 18:05:29', `note` = '', `reference1` = '293', `descriptionReference` = 'reference1:entityID del proveedor de credito para las facturas al credito,reference4: customerCreditLineID linea de credito del cliente', `reference2` = '', `reference3` = '', `reference4` = '0', `statusID` = '67', `amount` = 12, `currencyID` = '1', `currencyID2` = '2', `exchangeRate` = 36.2924, `sourceWarehouseID` = '4', `tax1` = 0, `subAmount` = 12
WHERE `companyID` = '2'
AND `transactionID` = '19'
AND `transactionMasterID` = '443'
---
   function update_app_posme($companyID,$transactionID,$transactionMasterID,$data){
		$db 	= db_connect();
		$builder	= $db->table("tb_transaction_master");

		$builder->where("companyID",$companyID);
		$builder->where("transactionID",$transactionID);
		$builder->where("transactionMasterID",$transactionMasterID);
		return $builder->update($data);