app/Models/Transaction_Master_Detail_Credit_Model.php

UPDATE `tb_transaction_master_detail_credit` SET `reference1` = '0', `reference2` = '1', `reference3` = '', `reference4` = '', `reference5` = '', `reference9` = 'reference1: Porcentaje de Gastos Fijos para las Facturas de Credito,reference2: Escritura Publica,reference3: Primer Linea del Protocolo'
WHERE `transactionMasterDetailID` = '1546'
---
   function update_app_posme($transactionMasterDetailID,$data){
		$db 	= db_connect();
		$builder	= $db->table("tb_transaction_master_detail_credit");

		$builder->where("transactionMasterDetailID",$transactionMasterDetailID);
		return $builder->update($data);

DELETE FROM `tb_transaction_master_detail_credit`
WHERE `transactionMasterID` = '443'
AND `transactionMasterDetailID` NOT IN ('1546')
---
   function deleteWhereIDNotIn( $transactionMasterID,$listTMD_ID){
		$db 		= db_connect();
		$builder	= $db->table("tb_transaction_master_detail_credit");

		$builder->where("transactionMasterID",$transactionMasterID);
		$builder->whereNotIn("transactionMasterDetailID",$listTMD_ID);

		$builder->delete();