app/Models/Transaction_Master_Detail_Model.php

   function update_app_posme($companyID,$transactionID,$transactionMasterID,$transactionMasterDetailID,$data){
		$db 	= db_connect();
		$builder	= $db->table("tb_transaction_master_detail");

		$builder->where("companyID",$companyID);
		$builder->where("transactionID",$transactionID);
		$builder->where("transactionMasterID",$transactionMasterID);
		$builder->where("transactionMasterDetailID",$transactionMasterDetailID);
		return $builder->update($data);
---
UPDATE `tb_transaction_master_detail` SET `quantity` = 1, `skuQuantity` = '1.00', `skuQuantityBySku` = '1.00', `unitaryCost` = '20.0000', `cost` = 20, `unitaryPrice` = 12, `unitaryAmount` = 12, `tax1` = 0, `amount` = 12, `reference1` = '', `reference2` = '', `reference3` = '0', `inventoryWarehouseSourceID` = '4', `skuCatalogItemID` = '78'
WHERE `companyID` = '2'
AND `transactionID` = '19'
AND `transactionMasterID` = '443'
AND `transactionMasterDetailID` = '1546'