app/Models/Transaction_Master_Info_Model.php

INSERT INTO `tb_transaction_master_info` (`companyID`, `transactionID`, `zoneID`, `routeID`, `referenceClientName`, `referenceClientIdentifier`, `receiptAmount`, `receiptAmountDol`, `transactionMasterID`) VALUES ('2', '19', '0', 0, 'te', 't', '13', '0', 397)
---
   function insert_app_posme($data){
		$db 		= db_connect();
		$builder	= $db->table("tb_transaction_master_info");
		$result 	= $builder->insert($data);

UPDATE `tb_transaction_master_info` SET `companyID` = '2', `transactionID` = '19', `transactionMasterID` = '443', `zoneID` = '157', `routeID` = 0, `referenceClientName` = '', `referenceClientIdentifier` = '', `receiptAmount` = '12.00', `receiptAmountDol` = '0.00'
WHERE `companyID` = '2'
AND `transactionID` = '19'
AND `transactionMasterID` = '443'
---
   function update_app_posme($companyID,$transactionID,$transactionMasterID,$data){
		$db 		= db_connect();
		$builder	= $db->table("tb_transaction_master_info");

		$builder->where("companyID",$companyID);
		$builder->where("transactionID",$transactionID);
		$builder->where("transactionMasterID",$transactionMasterID);
		return $builder->update($data);